[
  {
    "id": 1,
    "title": "Dark Storm",
    "image": "1.jpg",
    "genre": "drama",
    "rating": "8.3",
    "year": "2006",
    "description": "Is a 2006 science fiction disaster film directed by John Terlesky, featuring Stephen Baldwin as Dr. Daniel Gray. The narrative centers on a group of scientists who develop a device, code-named Eruptor, capable of manipulating dark matter to create controlled weather phenomena. However, the experiment goes awry, leading to catastrophic weather events that threaten global stability. The team races against time to prevent the device from causing irreversible damage. "
  },
  {
    "id": 2,
    "title": "Whisper of Fate",
    "image": "2.jpg",
    "genre": "fantasy",
    "rating": "7.7",
    "year": "2023",
    "description": "Is a captivating 2023 fantasy-thriller film that explores the delicate balance between fate and free will. The story follows a young woman who discovers a mysterious ability to hear the whispers of the future, guiding her decisions. As she unravels the secrets of her newfound power, she becomes entangled in a dangerous web of fate, where every choice could lead to a life-altering consequence. The film explores themes of destiny, self-discovery, and the consequences of one's actions, all set against a beautifully dark and atmospheric backdrop."
  },
  {
    "id": 3,
    "title": "Beyond the Edge",
    "image": "3.jpg",
    "genre": "horror",
    "rating": "6.3",
    "year": "2016",
    "description": "Is a 2016 American science fiction film directed by Michael Spierig and Peter Spierig. The story follows Dr. Abe Anderson (Sean Maher), a marine biologist, and Lt. Col. Harold Richards (Casper Van Dien), a pilot, who embark on a mission to explore the end of the universe. After 13 years, their ship crashes through the end of the universe, leading to unexpected and mind-bending consequences."
  },
  {
    "id": 4,
    "title": "Lost in Shadows",
    "image": "4.jpg",
    "genre": "action",
    "rating": "9.3",
    "year": "2016",
    "description": "Is a 2016 short film directed by Stephanie Clark. The story follows a young ballerina who arrives in the town of Teramere, unaware that the monstrous Spirit of the Shadows is seeking someone just like her to house the spirit of his lost love. The film has been praised for its atmospheric storytelling and compelling performances."
  },
  {
    "id": 5,
    "title": "Echoes of Power",
    "image": "5.jpg",
    "genre": "fantasy",
    "rating": "6.9",
    "year": "2023",
    "description": "Is a 2023 action-thriller that follows a team of elite operatives on a mission to prevent a global catastrophe caused by a shadowy organization. The film delves into themes of power, betrayal, and survival as the operatives face dangerous enemies and uncover a conspiracy that could change the world. Known for its intense action and compelling plot twists, the film keeps viewers on the edge of their seats with every twist and turn."
  },
  {
    "id": 6,
    "title": "Grim Reckoning",
    "image": "6.jpg",
    "genre": "drama",
    "rating": "8.4",
    "year": "2022",
    "description": "Is a short thriller film that delves into the psychological complexities of its characters. The narrative follows a protagonist grappling with past traumas, leading to a series of intense and suspenseful events. The film has been recognized for its compelling storytelling and strong performances."
  },
  {
    "id": 7,
    "title": "Fury's Flight",
    "image": "7.jpg",
    "genre": "action",
    "rating": "9.8",
    "year": "2007",
    "description": "Is a 2007 action thriller starring Steven Seagal as John Sands, a former Air Force pilot tasked with recovering a stolen stealth bomber. The film follows Sands as he confronts mercenaries and uncovers a plot involving biological warfare. Known for its high-octane action sequences, the movie has received mixed reviews, with some praising its intense action and others criticizing its production quality."
  },
  {
    "id": 8,
    "title": "Path of the Forgotten",
    "image": "8.jpg",
    "genre": "action",
    "rating": "7.2",
    "year": "2017",
    "description": "Is a 2017 South Korean psychological thriller directed by Jang Hang-jun. The film follows Jin-seok, a young man whose life is turned upside down when his older brother, Yoo-seok, is abducted. Nineteen days later, Yoo-seok returns with no memory of his captivity, leading Jin-seok to uncover a web of secrets and conspiracies that challenge his perception of reality. The film has been praised for its intricate plot and unexpected twists, keeping audiences on the edge of their seats. It has been described as a \"trippy ride\" with a time-bending narrative that explores themes of memory, identity, and trust. \"Forgotten\" is available for streaming on Netflix."
  },
  {
    "id": 9,
    "title": "Nightmare's Threshold",
    "image": "9.jpg",
    "genre": "horror",
    "rating": "1.7",
    "year": "2023",
    "description": "A chilling horror film about a man trapped in a nightmarish world with no escape."
  },
  {
    "id": 10,
    "title": "Eternal Hunt",
    "image": "10.jpg",
    "genre": "fantasy",
    "rating": "7.5",
    "year": "2021",
    "description": "A dark fantasy tale of a warrior on a never-ending quest to defeat a powerful enemy."
  },
  {
    "id": 11,
    "title": "Legacy of the Void",
    "image": "11.jpg",
    "genre": "action",
    "rating": "8.5",
    "year": "2019",
    "description": "A fast-paced action film where a group of elite soldiers confront a deadly alien force."
  },
  {
    "id": 12,
    "title": "Shadow's Crescent",
    "image": "12.jpg",
    "genre": "horror",
    "rating": "7.5",
    "year": "2020",
    "description": "A supernatural horror where an ancient curse resurfaces to haunt a small town."
  },
  {
    "id": 13,
    "title": "Crimson Dawn",
    "image": "13.jpg",
    "genre": "fantasy",
    "rating": "8.4",
    "year": "2018",
    "description": "A fantasy epic about a kingdom threatened by an ancient power, forcing a young prince to step up."
  },
  {
    "id": 14,
    "title": "Silent Kingdom",
    "image": "14.jpg",
    "genre": "fantasy",
    "rating": "6.5",
    "year": "2022",
    "description": "A young hero must defend a silent kingdom from dark forces bent on its destruction."
  },
  {
    "id": 15,
    "title": "Mystic Rite",
    "image": "15.jpg",
    "genre": "fantasy",
    "rating": "9.8",
    "year": "2024",
    "description": "A high-stakes fantasy adventure where magic users battle for control over an ancient artifact."
  },
  {
    "id": 16,
    "title": "Reign of the Lost",
    "image": "16.jpg",
    "genre": "horror",
    "rating": "9.1",
    "year": "2023",
    "description": "A terrifying story about a cursed kingdom and its desperate fight for survival."
  },
  {
    "id": 17,
    "title": "Timeless Myth",
    "image": "17.jpg",
    "genre": "drama",
    "rating": "4.0",
    "year": "2021",
    "description": "A dramatic tale about a family struggling with loss and the passage of time."
  },
  {
    "id": 18,
    "title": "Oath of the Fallen",
    "image": "18.jpg",
    "genre": "fantasy",
    "rating": "6.3",
    "year": "2022",
    "description": "A gripping fantasy about fallen heroes who must rise again to face their past mistakes."
  },
  {
    "id": 19,
    "title": "Veil of Night",
    "image": "19.jpg",
    "genre": "drama",
    "rating": "9.5",
    "year": "2024",
    "description": "A powerful drama set against a world on the brink of collapse, focusing on human resilience."
  },
  {
    "id": 20,
    "title": "Guardians of Twilight",
    "image": "20.jpg",
    "genre": "horror",
    "rating": "7.4",
    "year": "2021",
    "description": "A group of guardians must protect the world from a growing darkness threatening to engulf it."
  }
]
